src/cf/InformationRegisters/ДействияОбработкиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДействияОбработкиОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Обработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбработкиОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НастройкаОбработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОбработкиВидовОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Действия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ТипыЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыЗаданий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыполнениеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьТегиHtmlПередОзнакомлениемБыстрый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьТегиHtmlПередОзнакомлениемДолгий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьТегиHtmlПриНачалеСогласованияБыстрый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьТегиHtmlПриНачалеСогласованияДолгий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьУдалитьЗаполняемыйПредмет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеОзнакомленияСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапускОбработкиПоЗадачеЭлемента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапускОбработкиПоОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаршрутизацияКомплексногоПроцессаПослеВыполненияВложенного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаршрутизацияКомплексногоПроцессаПослеВыполненияЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаршрутизацияКомплексногоПроцессаПоСхемеПослеПродолжения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияИсполненияПроцессами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияМассовогоОзнакомления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияПроцессамиНовыеУчастники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияПроцессом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияСогласованияПроцессом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияСогласованияПроцессомНовыеУчастники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьHtmlПередОзнакомлением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьДанныеЗадачПоЗамещению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьДействиеОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьДействиеОзнакомленияЦеликомЕслиНужно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьЗадачуПоСостояниюДействия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьЗадачуПриПеренаправлении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьЗадачуУчастникаМассовогоОзнакомления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьОбработкуОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьПроцессБезДействия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработатьИзменениеКонтейнеровДля2ФА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстановитьОбработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстановитьПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьВыполнениеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьПринятиеКИсполнениюЗадачуПроцесса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерейтиКВыполнениюДействияВнеОчереди</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеренаправлениеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносСрокаВыполненияЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовитьПредметКСогласованиюВРежимеЗамечаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовкаОзнакомленияСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрерватьПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятьКИсполнениюЗадачуПроцесса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродолжитьВыполнениеОбработкиПослеЗавершенияОзнакомленияСОжиданием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродолжитьОбработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродолжитьПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьHtmlПриНачалеСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СохранитьРезультатВыполненияВЗадачуПроцесса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтартоватьПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьДанныеДляПредпросмотраФайла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьПроцессДляИсполнителейДействияИсполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьПроцессДляОбработкиОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьПроцессДляПунктаДействияИсполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьПроцессДляРассматривающегоДействияИсполнения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СостоянияОбработкиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияОбработкиОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остановлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прервана</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ОбработкиОбъектовХолдингСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Добавляет задание обновления действия в очередь заданий.
//
// Параметры:
//	Обработка - СправочникОбъект.ОбработкиОбъектов - Обработка, для которой необходимо добавить задание.
//
// Возвращаемое значение:
//	Булево - Истина - Задание добавлено.
//
Функция ДобавитьЗаданиеОбновитьОбработкуОбъекта(Обработка) Экспорт
	
	Если Не ОбщегоНазначенияДокументооборотХолдинг.ОбъектМожноОбработатьВОчередиЗаданий(Обработка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Обработка.ДополнительныеСвойства.Вставить("ВерсияФормата", КОДСервер.ТекущаяВерсияФормата());
	Обработка.ДополнительныеСвойства.Вставить("ХэшСуммаОбъекта",
		КОДСервер.ХешСуммаMD5СериализованногоОбъекта(Обработка, , Обработка.ДополнительныеСвойства.ВерсияФормата));
	Обработка.ДополнительныеСвойства.Вставить("АвторИзменения", ПользователиДокументооборот.ОлицетворяемыйПользователь());
	
	ЗаполнитьДанныеОбработкиОтправка(Обработка.ДополнительныеСвойства, Обработка);
	ОбработкаОчередиЗаданийСервер.ДобавитьЗаданиеОбновитьОбработкуОбъекта(Обработка, Обработка.ДополнительныеСвойства); 
	
	Возврат Истина;

КонецФункции

// Добавляет задания остановки, продолжения процесса в очередь заданий.
//
// Параметры:
//	ОбработкаОбъекта - СправочникСсылка.ОбработкиОбъектов - Обработка, для которой необходимо добавить задание.
//	СостояниеОбработки - ПеречислениеСсылка.СостоянияОбработкиОбъектов - Состояние обработки
//
// Возвращаемое значение:
//	Булево - Истина - Задание добавлено.
//
Функция ЗаданиеОстановитьПродолжитьОбработкуОбъектаДобавлено(ОбработкаОбъекта, СостояниеОбработки) Экспорт
	
	Если Не ОбщегоНазначенияДокументооборотХолдинг.ОбъектМожноОбработатьВОчередиЗаданий(ОбработкаОбъекта) Тогда
		Возврат Ложь;
	КонецЕсли;
		
	ТипЗадания = Перечисления.ТипыЗаданий.ОстановитьОбработку;
	Если СостояниеОбработки = Перечисления.СостоянияОбработкиОбъектов.Выполняется Тогда
		ТипЗадания = Перечисления.ТипыЗаданий.ПродолжитьОбработку;
	КонецЕсли;
	
	Если ОбработкаОчередиЗаданийСервер.ОбъектЕстьВОчереди(ОбработкаОбъекта, , ТипЗадания) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("АвторИзменения", ПользователиДокументооборот.ОлицетворяемыйПользователь());
	ОбработкаОчередиЗаданийСервер.ДобавитьЗаданиеОстановитьПродолжитьОбработкуОбъекта(ОбработкаОбъекта,
		СостояниеОбработки, ПараметрыЗадания);
	
	Возврат Истина;
	
КонецФункции

// Добавляет задание перехода к выполнению действия в очередь заданий.
//
// Параметры:
//  Действие - ОпределяемыйТип.Действия.
//
Процедура ДобавитьЗаданиеПерейтиКВыполнениюДействияВнеОчереди(Действие) Экспорт
	
	ОбработкаОбъекта = РегистрыСведений.ДействияОбработкиОбъектов.ОбработкаДействия(Действие);
	Если ОбработкаОчередиЗаданийСервер.ОбъектЕстьВОчереди(ОбработкаОбъекта, ,
		Перечисления.ТипыЗаданий.ПерейтиКВыполнениюДействияВнеОчереди) Тогда
		Возврат;
	КонецЕсли;
	
	УзелОбработки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбработкаОбъекта, "УзелОбработки");
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("АвторИзменения", ПользователиДокументооборот.ОлицетворяемыйПользователь());
	ОбработкаОчередиЗаданийСервер.ДобавитьЗаданиеПерейтиКВыполнениюДействияВнеОчереди(Действие, УзелОбработки,
		ПараметрыЗадания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполнить данные обработки для отправки.
// 
// Параметры:
//  ОбработкаОбъекта - СправочникОбъект.ОбработкиОбъектов - Обработка, для которой необходимо добавить задание.
//  ДанныеДляЗаполнения - Структура - данные заполнения
//
Процедура ЗаполнитьДанныеОбработкиОтправка(ДанныеДляЗаполнения, ОбработкаОбъекта)
	
	ЗаписьСообщения = КОДОтправка.ИнициализироватьЗаписьСообщения(
	ОтметкиВремени.ПредставлениеОтметки(ОтметкиВремени.Текущая()), 0, , , ДанныеДляЗаполнения.ВерсияФормата);
	ПолноеИмяОбъекта = ОбработкаОбъекта.Метаданные().ПолноеИмя();
	
	ТипДанных = КОДПовтИсп.ТипДанныхОбмена(ПолноеИмяОбъекта);
	Если ТипДанных = Неопределено Тогда
		ВызватьИсключение 
		СтрШаблон(НСтр("ru = 'Объект %1 не является типом данных КОД'"), ПолноеИмяОбъекта);
	КонецЕсли;
	
	ОбъектXDTO = КОДОтправка.НовыйОбъектXDTO(ТипДанных.ПолноеИмя, ЗаписьСообщения);
	КОДОтправка.ЗаполнитьСсылочныйОбъект(ОбъектXDTO, ОбработкаОбъекта, ЗаписьСообщения);
	КОДОтправка.ЗаполнитьОдноименныеСвойстваXDTOРеквизитами(ОбъектXDTO, ОбработкаОбъекта, ЗаписьСообщения);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("object");
	ЗаписьСообщения.ФабрикаXDTO.ЗаписатьJSON(ЗаписьJSON, ОбъектXDTO, НазначениеТипаXML.Явное);
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	
	ДанныеДляЗаполнения.Вставить("ОбъектJSON", ЗаписьJSON.Закрыть());

КонецПроцедуры

#КонецОбласти
